app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY release_date
---
  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:title => :asc}, 'hilite'
    when 'release_date'
      ordering,@date_header = {:release_date => :asc}, 'hilite'
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Man in blackIII"], ["rating", "G"], ["release_date", "2017-03-16 00:00:00.000000"], ["created_at", "2017-03-16 19:17:37.408537"], ["updated_at", "2017-03-16 19:17:37.408537"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @movie = Movie.find params[:id]

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "rating" = ?, "director" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "G"], ["director", "David Lee"], ["release_date", "2017-03-19 00:00:00.000000"], ["updated_at", "2017-03-19 04:40:44.294838"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 2]]
---
  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "George Lucas"]]
---
  def show_same_director
    movie = Movie.find(params[:id])
    director = movie.director
    if director.length == 0
      flash[:notice] = "'#{movie.title}' has no director info"
      redirect_to movies_path
    end
    @movies_same_director = Movie.where(:director => director)